Revit 2024 API
ICodeCheckingParameterServer Interface
 Interface for the code checking parameter server to implement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public interface ICodeCheckingParameterServer : IExternalServer
Visual Basic
Public Interface ICodeCheckingParameterServer _
	Inherits IExternalServer
Visual C++
public interface class ICodeCheckingParameterServer : IExternalServer
See Also
ICodeCheckingParameterServer Members
Autodesk.Revit.DB.Structure Namespace